<?php

declare(strict_types=1);

namespace App\Dto\Nrg;

use App\Enums\RegionType;

class LocationComparisonsDto
{
    /**
     * Коды стран, с которыми работает ТК.
     */
    public array $countryCodes = [
        0 => "RU",
        86015311036992 => "RU",
        86015311037009 => "KZ",
        86015311037004 => "KG",
        86015311036993 => "BY",
        86015311037003 => "AM",
        86015311037018 => "RU",
    ];

    /**
     * Слова, которые определяют отношение строки в системе ТК к субъекту старны.
     */
    public array $regionsType = [
        'область',
        'округ',
        'край',
        'республика',
    ];

    /**
     * Некорректные названия субъектов стран, обнаруженные в системе ТК.
     */
    public array $uncorrectRegionNames = [
        'Башкортостан Республика',
        'Хакасия Республика',
        'Автономный Округ',
        'Татарстан Республика',
        'Республика Северная Осетия-Алания',
        'Республика Чувашия',
        'Ингушетия Республика',
        'Еврейская А.о.',
        'Мордовия Республика',
        'Тыва Республика',
        'Посёлок В Ямало-Ненецком Автономном Округе',
        'Бурятия Республика',
        'Республика Татарста',
        'Район Хабаровский край',
        'Крым Республика',
        'Р.п. Омская область',
        'Деревня  Иркутская область',
        'Калмыкия Республика',
        'Саха (Якутия) Республика',
        'Адыгея Республика',
        'Город В Ямало-Ненецком Автономном Округе',
        'Кчр',
        'Посёлок В Пуровском Районе Ямало-Ненецкого Автономного Округа',
        'Край Благовещенска',
        'Ашкортостан Республика',
        'Георгиевский Городский Округ',
        'Рузский Городской Округ',
        'Владивостокский Городской Округ',
        'Предгорный Муниципальный Округ',
        'Городской Округ Йошкар-Ола',
        'Городский Округ Йошкар-Ола',
        'Жд Станция Приморский Край',
        'Оренбургская Область Абдулинский Район',
        'Партизанский Городской Округ',
        'Рабочий Посёлок. Иркутская Область',
        'Село Республика Башкортостан',
        'Приморский Край Зато Фокино',
        'Сельское Поселение Пермский Край',
        'Г. Омская Область',
        'Починковский Муниципальный Округ',
        'Город Свердловская Область',
        'Железногорский Городской Округ',
        'Волоколамский Городской Округ',
        'Село Новосибирская Область',
        'Калужская Область.',
        'Дивногорский Городской Округ',
        'Дальнегорский Округ',
        'Деревня  Иркутская Область',
        'Одинцовский Городской Округ',
        'Р.п. Омская Область',
        'Александровский Муниципальный Округ',
        'Район Хабаровский Край',
        'Село. Московская Область',
        'Томаринский Городской Округ',
        'Поселок. Республика Башкортостан',
        'Артёмовский Городской Округ',
        'Рузский Городской  Округ',
        'Республика Башкортостан Давлекановский Район',
        'Городской Округ Клин',
        'Уссурийский Городской Округ',
        'Город-Порт Камчатского Края. Городской Округ Вилючинский.',
        'Находкинский Городской Округ',
        'Деревня. Республика Башкортостан',
        'Иркутский Муниципальный Округ',
        'Москвоская Область',
    ];

    /**
     * Коректные наименования субъектов стран.
     */
    public array $correctRegionNames = [
        'Республика Башкортостан',
        'Республика Хакасия',
        'автономный округ',
        'Республика Татарстан',
        'Республика Северная Осетия — Алания',
        'Чувашская Республика — Чувашия',
        'Республика Ингушетия',
        'Еврейская автономная область',
        'Республика Мордовия',
        'Республика Тыва',
        'Ямало-Ненецкий автономный округ',
        'Республика Бурятия',
        'Республика Татарстан',
        'Хабаровский край',
        'Республика Крым',
        'Омская область',
        'Иркутская область',
        'Республика Калмыкия',
        'Республика Саха (Якутия)',
        'Республика Адыгея',
        'Ямало-Ненецкий автономный округ',
        'Карачаево-Черкесская Республика',
        'Ямало-Ненецкий автономный округ',
        'Амурская область',
        'Республика Башкортостан',
        'Ставропольский край',
        'Московская область',
        'Приморский край',
        'Ставропольский край',
        'Республика Марий Эл',
        'Республика Марий Эл',
        'Приморский Край',
        'Оренбургская область',
        'Приморский край',
        'Иркутская область',
        'Республика Башкортостан',
        'Приморский край',
        'Пермский край',
        'Омская область',
        'Нижегородская область',
        'Свердловская область',
        'Курская область',
        'Московская область',
        'Новосибирская область',
        'Калужская область',
        'Красноярский край',
        'Приморский край',
        'Иркутская область',
        'Московская область',
        'Омская область',
        'Пермский край',
        'Хабаровский край',
        'Московская область',
        'Сахалинская область',
        'Республика Башкортостан',
        'Приморский край',
        'Московская область',
        'Республика Башкортостан',
        'Московская область',
        'Приморский край',
        'Камчатский край',
        'Приморский край',
        'Республика Башкортостан',
        'Иркутская область',
        'Московская область',
    ];

    /**
     * Слова, которые нужно привести к нижнему регистру.
     */
    public array $upperWords = [
        'Область',
        'Край',
    ];

    /**
     * Слова, которыми будет произведена замена.
     */
    public function getLowerWords(): array
    {
        return [
            RegionType::Area->value,
            RegionType::Edge->value,
        ];
    }

    /**
     * Слова, которые определяют принадлежность к типу локации.
     */
    public array $dirtyLocationType = [
        'аул',
        'белгородский район',
        'богородский район',
        'боровский район',
        'борский район',
        'г. томск',
        'го бор',
        'гордеевский район',
        'город',
        'город новороссийск',
        'городецкий район',
        'городищенский район',
        'городок',
        'городское поселение',
        'городской поселок',
        'дачный поселок',
        'деверня',
        'деервня',
        'деревня',
        'ж/д станция',
        'жилмассив пос. садовый',
        'жк',
        'зато фокино',
        'красногородский район',
        'микрорайон',
        'микрорайон елизово',
        'населенный пункт',
        'пгт',
        'пгт звениговский район',
        'пгт килемарский район',
        'пгт.',
        'полелок',
        'поселок городского типа',
        'поселок санкт-петербург',
        'посёлок',
        'пригородный район',
        'р.п.',
        'рабочий поселок',
        'районный поселок',
        'рапочий поселок',
        'рп',
        'село',
        'сельский поселок',
        'сельское поселение',
        'снт',
        'спк',
        'станица',
        'стания',
        'станция',
        'хутор',
        'поселок',
        'оселок',
    ];

    /**
     * Нормализованные наименования типов локаций.
     */
    public function getCleanLocationType(): array
    {
        return [
            RegionType::Aul->value,
            RegionType::District->value,
            RegionType::District->value,
            RegionType::District->value,
            RegionType::District->value,
            RegionType::Town->value,
            RegionType::Town->value,
            RegionType::District->value,
            RegionType::Town->value,
            RegionType::Town->value,
            RegionType::District->value,
            RegionType::District->value,
            RegionType::SmallTown->value,
            RegionType::Pgt->value,
            RegionType::Pgt->value,
            RegionType::Township->value,
            RegionType::Hamlet->value,
            RegionType::Hamlet->value,
            RegionType::Hamlet->value,
            RegionType::Station->value,
            RegionType::ResidentialComplex->value,
            RegionType::ResidentialComplex->value,
            RegionType::Zato->value,
            RegionType::District->value,
            RegionType::Microdistrict->value,
            RegionType::Microdistrict->value,
            RegionType::Locality->value,
            RegionType::Pgt->value,
            RegionType::Pgt->value,
            RegionType::Pgt->value,
            RegionType::Pgt->value,
            RegionType::Township->value,
            RegionType::Township->value,
            RegionType::Town->value,
            RegionType::Township->value,
            RegionType::District->value,
            RegionType::JobVillage->value,
            RegionType::JobVillage->value,
            RegionType::Township->value,
            RegionType::JobVillage->value,
            RegionType::JobVillage->value,
            RegionType::Village->value,
            RegionType::Township->value,
            RegionType::Township->value,
            RegionType::Snt->value,
            RegionType::Spk->value,
            RegionType::Stanitsa->value,
            RegionType::Station->value,
            RegionType::Station->value,
            RegionType::Farmstead->value,
            RegionType::Township->value,
            RegionType::Township->value,
        ];
    }

    /**
     * Нежелательные наименования типов локаций.
     */
    public array $uncorrectTypes = [
        'ПГТ килемарский район',
        'ПГТ звениговский район',
        'ПГТ.',
        'посёлок в елизовском районе камчатского края',
        'СНТ 22 км голоустинского тракта',
        'посёлок в иркутском районе иркутской области',
        'посёлок городского типа',
        'закрытый город до кпп',
        'янаульский район',
        'село в иркутском районе иркутской области',
        'строитель СНТ',
        'верхнекубанское посёлок',
        'железнодорожная станция улак',
        'голоустинский тракт. деревня в иркутском районе иркутской области.',
        'посёлок-санаторий',
    ];

    /**
     * Корректные наименования типов локаций.
     */
    public function getCorrectTypes(): array
    {
        return [
            RegionType::Pgt->value,
            RegionType::Pgt->value,
            RegionType::Pgt->value,
            RegionType::Township->value,
            RegionType::Snt->value,
            RegionType::Township->value,
            RegionType::Pgt->value,
            RegionType::Zato->value,
            RegionType::Town->value,
            RegionType::Village->value,
            RegionType::Snt->value,
            RegionType::Township->value,
            RegionType::Station->value,
            RegionType::Hamlet->value,
            RegionType::Township->value,
        ];
    }
}
